import streamlit as st

#ส่วนหัวข้อเว็บ (Header)
st.title ("ยินดีต้อนรับสู่โปรไพล์ของฉัน 🩷 ")
st.write("นี่คือเว็บแอปพลิเคชั่นแรกในชีวิตของดิฉัน เขียนด้วยภาษา Python ค่ะ")

st.divider() # เส้นคั่นแบ่งสัดส่วนให้สวยงาม

# ส่วนข้อมูลส่วนบุคคล (Profile Info)
st.header("👤 ข้อมูลส่วนบุคคล")
st.write("**ชื่อ-นาสกุล:** นางสาว​ อารยา  กันยา")
st.write("**ชั้น​ ม.4/3** เลขที่​ 22")
st.write("**โรงเรียน:** ยุพราชวิทยาลัย")

# ส่วนปุ่มกดแสดงความรู้สึก
if st.button("คลิกบอกความรู้สึกกับการเขียนเว็บครั้งแรก"):
    st.success(f"ว้าว! สนุกและง่ายกว่าที่คิดมาก ๆ!​ 🎉")
